Tekla Open API Reference for Tekla Structures 2025
RadialGrid Properties
The RadialGrid type exposes the following members.
Properties
Name | Description
AngularCoordinates
 The angular coordinates of the grid lines
AngularLabels
 The labels for the angular grid lines.
AngularLinesEndExtension
 The extension of the angular grid lines at their end point.
AngularLinesStartExtension
 The extension of the angular grid lines at their start point.
ArcEndExtension
 The extension of the grid arcs at their end point.
ArcStartExtension
 The extension of the grid arcs at their start point.
Color
 Gets or sets the color of the grid.
CoordinateZ
 The coordinates for the Z-axis.
ExtensionAboveZ
 The extension above Z-axis.
ExtensionBelowZ
 The extension below the Z-axis.
FontColor
 Gets or sets font color for the grid labels
 (Inherited from GridBase.)
FontSize
 Gets or sets font size for the grid labels
 (Inherited from GridBase.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsMagnetic
 Gets or sets whether the grid is magnetic or not
 (Overrides GridBase.IsMagnetic.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LabelZ
 The labels for the Z-axis.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 Gets or sets the name of the grid.
 (Inherited from GridBase.)
Origin
 Gets or sets the origin of the grid
 (Inherited from GridBase.)
RadialCoordinates
 The distances between the radii of the arcs
RadialLabels
 The labels for the grid arcs.
Top
See Also
Reference
RadialGrid Class
Tekla.Structures.Model Namespace